chore: updated architecture diagram
